---
type: AssetPropertyFloat
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 2
tags: [revit-api, class]
---

# AssetPropertyFloat

`Autodesk.Revit.DB.Visual.AssetPropertyFloat` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidValue | 2018.1 | `public bool IsValidValue ( float value )` |
| Property | Value | — | `public float Value { get ; set ; }` |